zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_usbfs_dev_drv_io_dma.c
/***************************************************************************//**
* \file cy_usbfs_dev_drv_io_dma.c
* \version 2.30.1
*
* Provides data transfer API implementation of the USBFS driver.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXUSBFS) && defined (CY_IP_MXPERI)

#include <string.h>
#include "cy_usbfs_dev_drv_pvt.h"

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
*                        Internal Constants
*******************************************************************************/

/* Invalid channel */
#define DMA_INVALID_CHANNEL     ((uint32_t) (-1))

/* Arbiter interrupt sources for OUT and IN endpoints when mode is
* CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
*/
#define IN_ENDPOINT_ARB_INTR_SOURCES    (USBFS_USBDEV_ARB_EP_IN_BUF_FULL_Msk | \
                                         USBFS_USBDEV_ARB_EP_BUF_OVER_Msk    | \
                                         USBFS_USBDEV_ARB_EP_BUF_UNDER_Msk   | \
                                         USBFS_USBDEV_ARB_EP_ERR_Msk)

#define OUT_ENDPOINT_ARB_INTR_SOURCES   (USBFS_USBDEV_ARB_EP_DMA_TERMIN_Msk | \
                                         USBFS_USBDEV_ARB_EP_BUF_OVER_Msk   | \
                                         USBFS_USBDEV_ARB_EP_BUF_UNDER_Msk  | \
                                         USBFS_USBDEV_ARB_EP_ERR_Msk)

/* DMA configuration defines */
#define DMA_XLOOP_INCREMENT    (1)
#define DMA_YLOOP_INCREMENT    (32)
#define DMA_NO_INCREMENT       (0)

/* Timeout for dynamic reconfiguration */
#define DYN_RECONFIG_ONE_TICK   (1U)        /* 1 tick = 1 us */
#define DYN_RECONFIG_TIMEOUT    (25000UL)   /* (25000 * tick)us = 25 ms ( TDRQCMPLTND / 2 ) */

/* Timeout for DMA read operation */
#define DMA_READ_REQUEST_ONE_TICK   (1U)      /* 1 tick = 1 us */
#define DMA_READ_REQUEST_TIMEOUT    (25000UL) /* (25000 * tick)us = 25 ms ( TDRQCMPLTND / 2 ) */

#define DMA_WRITE_REQUEST_ONE_TICK   (1U)      /* 1 tick = 1 us */
#define DMA_WRITE_REQUEST_TIMEOUT    (25000UL) /* (25000 * tick)us = 25 ms ( TDRQCMPLTND / 2 ) */


/*******************************************************************************
*                        Internal Functions Prototypes
*******************************************************************************/

static void DmaEndpointInit1D(cy_stc_dma_descriptor_t *descr,
                              bool inDirection,
                              cy_en_dma_data_size_t dataSize,
                              volatile uint32_t const *dataReg);

static void DmaEndpointInit2D(cy_stc_dma_descriptor_t *descr,
                              bool inDirection,
                              int32_t numElements);

static void DmaEndpointSetLength(bool inDirection,
                                 uint32_t size,
                                 cy_stc_usbfs_dev_drv_endpoint_data_t *endpoint);


/*******************************************************************************
*                            Internal Constants
*******************************************************************************/

/* Used for getting data in X loops */
#define DMA_DESCR_1D_CFG \
{                        \
    /* .retrigger      = */ CY_DMA_RETRIG_IM,        \
    /* .interruptType  = */ CY_DMA_DESCR,            \
    /* .triggerOutType = */ CY_DMA_DESCR,            \
    /* .channelState   = */ CY_DMA_CHANNEL_DISABLED, \
    /* .triggerInType  = */ CY_DMA_DESCR,            \
    /* .dataSize        = */ CY_DMA_BYTE,               \
    /* .srcTransferSize = */ CY_DMA_TRANSFER_SIZE_WORD, \
    /* .dstTransferSize = */ CY_DMA_TRANSFER_SIZE_WORD, \
    /* .descriptorType  = */ CY_DMA_1D_TRANSFER,        \
    /* .srcAddress     = */ NULL, \
    /* .dstAddress     = */ NULL, \
    /* .srcXincrement  = */ 0,    \
    /* .dstXincrement  = */ 0,    \
    /* .xCount         = */ 1UL,  \
    /* .srcYincrement  = */ 0,    \
    /* .dstYincrement  = */ 0,    \
    /* .yCount         = */ 1UL,  \
    /* .nextDescriptor = */ NULL, \
}

/* Used for getting data in Y loops */
#define DMA_DESCR_2D_CFG \
{                        \
    /* .retrigger      = */ CY_DMA_RETRIG_IM,       \
    /* .interruptType  = */ CY_DMA_X_LOOP,          \
    /* .triggerOutType = */ CY_DMA_X_LOOP,          \
    /* .channelState   = */ CY_DMA_CHANNEL_ENABLED, \
    /* .triggerInType  = */ CY_DMA_X_LOOP,          \
    /* .dataSize        = */ CY_DMA_BYTE,               \
    /* .srcTransferSize = */ CY_DMA_TRANSFER_SIZE_WORD, \
    /* .dstTransferSize = */ CY_DMA_TRANSFER_SIZE_WORD, \
    /* .descriptorType  = */ CY_DMA_2D_TRANSFER,        \
    /* .srcAddress     = */ NULL, \
    /* .dstAddress     = */ NULL, \
    /* .srcXincrement  = */ 0,    \
    /* .dstXincrement  = */ 0,    \
    /* .xCount         = */ 1UL,  \
    /* .srcYincrement  = */ 0,    \
    /* .dstYincrement  = */ 0,    \
    /* .yCount         = */ 1UL,  \
    /* .nextDescriptor = */ NULL, \
}


/*******************************************************************************
* Function Name: DmaInit
****************************************************************************//**
*
* Initializes all DMA channels used by the USBFS Device.
*
* \param config
* The pointer to the driver configuration structure \ref cy_stc_usbfs_dev_drv_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t DmaInit(cy_stc_usbfs_dev_drv_config_t const *config, cy_stc_usbfs_dev_drv_context_t *context)
{
    cy_en_usbfs_dev_drv_status_t retStatus = CY_USBFS_DEV_DRV_DMA_CFG_FAILED;

    uint32_t endpoint;

    /* Configure DMA descriptors and channels for data endpoints */
    for (endpoint = 0UL; endpoint < CY_USBFS_DEV_DRV_NUM_EPS_MAX; ++endpoint)
    {
        /* DMA configuration status for endpoint */
        retStatus = CY_USBFS_DEV_DRV_DMA_CFG_FAILED;

        /* Get pointer to endpoint data */
        cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData = &context->epPool[endpoint];

        if (config->dmaConfig[endpoint] != NULL)
        {
            cy_en_usbfs_dev_drv_status_t locStatus = CY_USBFS_DEV_DRV_DMA_CFG_FAILED;

            cy_stc_dma_channel_config_t chConfig;

