zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_usbfs_dev_drv_io_dma.c
/*******************************************************************************
* Function Name: DmaEndpointInit2D
****************************************************************************//**
*
* Configures DMA 2D descriptor used in the DMA Automatic mode.
*
* \param descr
* The pointer to the DMA descriptor.
*
* \param inDirection
* Endpoint direction associated with DMA descriptor.
*
* \param numElements
* Number of elements to transfer.
*
*******************************************************************************/
static void DmaEndpointInit2D(cy_stc_dma_descriptor_t *descr, bool inDirection,
                              int32_t numElements)
{
    /* Descriptor 0 (2D): it transfers number of data elements (X loop count)
    * and increments source/destination (depends on direction) by this amount
    * (Y loop increment).
    */
    Cy_DMA_Descriptor_SetXloopDataCount(descr, (uint32_t) numElements);

    if (inDirection)
    {
        Cy_DMA_Descriptor_SetYloopSrcIncrement(descr, numElements);
        Cy_DMA_Descriptor_SetYloopDstIncrement(descr, DMA_NO_INCREMENT);
    }
    else
    {
        Cy_DMA_Descriptor_SetYloopSrcIncrement(descr, DMA_NO_INCREMENT);
        Cy_DMA_Descriptor_SetYloopDstIncrement(descr, numElements);
    }
}


/*******************************************************************************
* Function Name: DmaEndpointSetLength
****************************************************************************//**
*
* Completes DMA initialization for the OUT data endpoint.
* Applicable only when mode is \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
*
* \param inDirection
* Endpoint direction associated with DMA descriptor.
*
* \param size
* The number of bytes to load into endpoint.
* This value must be less than or equal to the endpoint maximum packet size.
*
* \param endpoint
* The pointer to the structure that stores endpoint information.
*
*******************************************************************************/
static void DmaEndpointSetLength(bool inDirection, uint32_t size,
                                 cy_stc_usbfs_dev_drv_endpoint_data_t *endpoint)
{
    uint8_t *buf = endpoint->buffer;

    /*
    * Descriptor 0: get number of Y loops. It transfers data in multiples of 32 bytes.
    * Descriptor 1: get number of X loops. It transfers data what was left 1-31 bytes.
    */
    uint32_t numYloops = size / (uint32_t) DMA_YLOOP_INCREMENT;
    uint32_t numXloops = size % (uint32_t) DMA_YLOOP_INCREMENT;

    /* Configure */
    if (inDirection)
    {
        endpoint->startBuf = (uint16_t) size;  /* Store DMA transfer size */
        Cy_DMA_Descriptor_SetSrcAddress(endpoint->descr0, buf);
        Cy_DMA_Descriptor_SetSrcAddress(endpoint->descr1, &buf[size - numXloops]);
    }
    else
    {
        endpoint->startBuf = (numYloops > 0U) ? 1U : 0U; /* Store 1st DMA descriptor to execute */
        Cy_DMA_Descriptor_SetDstAddress(endpoint->descr0, buf);
        Cy_DMA_Descriptor_SetDstAddress(endpoint->descr1, &buf[size - numXloops]);
    }

    /* Configure loop length */
    if (numYloops > 0UL)
    {
        Cy_DMA_Descriptor_SetYloopDataCount(endpoint->descr0, numYloops);
    }

    if (numXloops > 0UL)
    {
        Cy_DMA_Descriptor_SetXloopDataCount(endpoint->descr1, numXloops);
    }

    /* Chain descriptors to operate */
    if (numYloops == 0UL)
    {
        /* (Size < 32): only Descriptor 1 transfers data */
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr1, endpoint->descr1);
    }
    else if (numXloops == 0UL)
    {
        /* Size multiple of 32: only Descriptor 0 transfers data */
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr0, endpoint->descr0);
    }
    else
    {
        /* (Size > 32): both Descriptor 0 and 1 transfer data */
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr0, endpoint->descr1);
        Cy_DMA_Descriptor_SetNextDescriptor(endpoint->descr1, endpoint->descr0);
    }

    /* Keep channel enabled after execution of Descriptor 0 to execute Descriptor 1 */
    Cy_DMA_Descriptor_SetChannelState(endpoint->descr0,
                                        ((numYloops > 0UL) && (numXloops > 0UL)) ?
                                            CY_DMA_CHANNEL_ENABLED : CY_DMA_CHANNEL_DISABLED);

    /* Start execution from Descriptor 0 (length >= 32) or Descriptor 1 (length < 32) */
    Cy_DMA_Channel_SetDescriptor(endpoint->base, endpoint->chNum,
                                    ((numYloops > 0UL) ? endpoint->descr0 : endpoint->descr1));

    /* Configuration complete: enable channel */
    Cy_DMA_Channel_Enable(endpoint->base, endpoint->chNum);
}


/*******************************************************************************
* Function Name: DmaOutEndpointRestore
****************************************************************************//**
*
* Restores the DMA channel after transfer is completed for the the OUT data endpoint.
* Applicable only when mode is \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
*
* \param endpoint
* The pointer to the structure that stores endpoint information.
*
*******************************************************************************/
void DmaOutEndpointRestore(cy_stc_usbfs_dev_drv_endpoint_data_t *endpoint)
{
    /* Number of clocks for DMA completion pulse */
    const uint32_t CY_USBFS_DEV_DRV_TRIG_CYCLES = 2UL;

    /* Define which descriptor is 1st in the chain */
    bool setDescr0 = (0U != endpoint->startBuf);

    /* Channel disable aborts on-going transfer */
    Cy_DMA_Channel_Disable(endpoint->base, endpoint->chNum);

    /* Send pulse to UBSFS IP to indicate end of DMA transfer */
    (void) Cy_TrigMux_SwTrigger(endpoint->outTrigMux, CY_USBFS_DEV_DRV_TRIG_CYCLES);

    /* Set 1st DMA descriptor for the following transfer */
    Cy_DMA_Channel_SetDescriptor(endpoint->base, endpoint->chNum,
                                                (setDescr0 ? endpoint->descr0 : endpoint->descr1));

    Cy_DMA_Channel_Enable(endpoint->base, endpoint->chNum);
}


